Experiment 3


1.
2.24
  2

3. $NVMVVBXl;ansxa.l.sxnasxuVCCC

4. copy run start

5. yes, because we have configured the pc with switch

configure switch
a. Use the following commands to configure S1 with an IP address.
S1 #configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)# interface vlan 1
S1(config-if)# ip address 192.168.1.2 255.255.255.0
S1(config-if)# no shutdown
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
S1(config-if)#
S1(config-if)# exit
S1#

configure vty to allow telnet(remote) access

S1(config)# line vty 0 4
S1(config-line)# password cisco
S1(config-line)# login
S1(config-line)# end
S1#

configure Router
R> enable
R # configure terminal
R (config) # interface gigabitEthernet 0/0
R(config-if)# ip address 192.168.1.2 255.255.255.0
R(config-if)# no shutdown
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
R(config-if)#
R(config-if)# exit
R (config) # interface gigabitEthernet 0/1
R(config-if)# ip address 172.16.5.1 255.255.0.0
R(config-if)# no shutdown
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
R(config-if)#
R(config-if)# end
R# copy run start
R#exit

configure default gateway
S1 >en
S1 # configure terminal
S1 (config)# ip default-gateway 192.168.1.1
S1 (config)#exit
S1 # copy run start
Likewise on S2:
S2 >en
S2 # configure terminal
S2 (config)# ip default-gateway 172.16.5.1
S2 (config)#exit
S2 # copy run start
